justimepassnow/custom_servo/mm32_test/src/main.c
// Non-blocking binary packet parser
void process_packet_input(void) {
    static RxState rx_state = RX_STATE_HEADER1;
    static uint8_t rx_id = 0;
    static uint8_t rx_length = 0;
    static uint8_t rx_instruction = 0;
    static uint8_t rx_params[32];
    static uint8_t rx_param_count = 0;
    static uint8_t target_param_count = 0;

    // Clear Overrun Error (ORE) if it occurred, preventing hard lockups
    if (USART_GetFlagStatus(USART1, USART_FLAG_ORE) != RESET) {
        USART_ReceiveData(USART1); 
    }

    if (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) != RESET) {
        uint8_t c = (uint8_t)USART_ReceiveData(USART1);

        switch (rx_state) {
            case RX_STATE_HEADER1:
                if (c == 0xFF) {
                    rx_state = RX_STATE_HEADER2;
                }
                break;
            case RX_STATE_HEADER2:
                if (c == 0xFF) {
                    rx_state = RX_STATE_ID;
                } else {
                    rx_state = RX_STATE_HEADER1;
                }
                break;
            case RX_STATE_ID:
                if (c == config.servo_id || c == 0xFE) { // Explicit ID or Broadcast ID
                    rx_id = c;
                    rx_state = RX_STATE_LENGTH;
                } else if (c == 0xFF) {
                    rx_state = RX_STATE_ID; // Shifted header: could be 3rd 0xFF in a row
                } else {
                    rx_state = RX_STATE_HEADER1;
                }
                break;
            case RX_STATE_LENGTH:
                if (c >= 2 && c <= 32) {
                    rx_length = c;
                    rx_state = RX_STATE_INSTRUCTION;
                } else {
                    rx_state = RX_STATE_HEADER1;
                }
                break;
            case RX_STATE_INSTRUCTION:
                rx_instruction = c;
                rx_param_count = 0;
                target_param_count = rx_length - 2;
                if (target_param_count > 0) {
                    rx_state = RX_STATE_PARAMETERS;
                } else {
                    rx_state = RX_STATE_CHECKSUM;
                }
                break;
            case RX_STATE_PARAMETERS:
                rx_params[rx_param_count++] = c;
                if (rx_param_count >= target_param_count) {
                    rx_state = RX_STATE_CHECKSUM;
                }
                break;
            case RX_STATE_CHECKSUM:
                {
                    uint8_t rx_checksum = c;
                    uint8_t sum = rx_id + rx_length + rx_instruction;
                    for (uint8_t i = 0; i < target_param_count; i++) {
                        sum += rx_params[i];
                    }
                    uint8_t calculated_checksum = ~sum;

                    if (calculated_checksum == rx_checksum) {
                        // 1. CONTROL Command
                        if (rx_instruction == 0x01) {
                            if (!overcurrent_fault && !stall_fault) {
                                uint16_t cmd_angle = rx_params[0] | (rx_params[1] << 8);
                                uint16_t cmd_velocity = rx_params[2] | (rx_params[3] << 8);
                                
                                if (cmd_angle < config.min_angle) cmd_angle = config.min_angle;
                                if (cmd_angle > config.max_angle) cmd_angle = config.max_angle;
                                
                                target_angle = cmd_angle;
                                active_velocity = (cmd_velocity == 0) ? config.max_velocity : cmd_velocity;
                                status_reporting_enabled = 1;
                                motor_armed = 1; // Arm motor upon first valid CONTROL command!
                            }
                            if (rx_id != 0xFE) {
                                send_status_reply(0x01);
                            }
                        } 
                        // 2. CONFIG Command
                        else if (rx_instruction == 0x02) {
                            uint8_t update_mask = rx_params[0];
                            ServoConfig new_cfg = config;
                            
                            if (update_mask & (1 << 0)) {
                                new_cfg.servo_id = rx_params[1] & 0x7F; // Extract 7-bit ID
                                new_cfg.direction_invert = (rx_params[1] >> 7) & 0x01; // Extract MSB as direction invert flag
                            }
                            if (update_mask & (1 << 1)) {
                                new_cfg.min_angle = rx_params[2] | (rx_params[3] << 8);
                                new_cfg.max_angle = rx_params[4] | (rx_params[5] << 8);
                            }
                            if (update_mask & (1 << 2)) {
                                new_cfg.max_velocity = rx_params[6] | (rx_params[7] << 8);
                            }
                            if (update_mask & (1 << 3)) {
                                new_cfg.current_limit = rx_params[8] | (rx_params[9] << 8);
                            }
                            if (update_mask & (1 << 4)) {
                                new_cfg.kp_q16 = rx_params[10] | (rx_params[11] << 8) | (rx_params[12] << 16) | (rx_params[13] << 24);
                                new_cfg.ki_q16 = rx_params[14] | (rx_params[15] << 8) | (rx_params[16] << 16) | (rx_params[17] << 24);
                                new_cfg.kd_q16 = rx_params[18] | (rx_params[19] << 8) | (rx_params[20] << 16) | (rx_params[21] << 24);
                            }
                            if (update_mask & (1 << 5)) {
                                new_cfg.hard_min_angle = rx_params[22] | (rx_params[23] << 8);
                                new_cfg.hard_max_angle = rx_params[24] | (rx_params[25] << 8);
                            }
                            
                            // Bit 6: Volatile (RAM-only) update flag
                            if (!(update_mask & (1 << 6))) {
                                flash_write_config(&new_cfg);
                            }
                            config = new_cfg;
                            Kp_q16 = config.kp_q16;
                            Ki_q16 = config.ki_q16;
                            Kd_q16 = config.kd_q16;
                            
                            if (rx_id != 0xFE) {
                                send_status_reply(0x02);
                            }
                        } 
                        // 3. POLL_STATUS Command
                        else if (rx_instruction == 0x03) {
                            if (rx_id != 0xFE) {
                                send_status_reply(0x03);
                            }
                        } 
                        // 4. CLEAR_ERROR Command
                        else if (rx_instruction == 0x04) {
                            overcurrent_fault = 0;
                            stall_fault = 0;
                            overcurrent_ms = 0;
                            pid_integral = 0;
                            prev_error = 0;
                            motor_armed = 0; // Disarm motor to allow manual shaft positioning!
                            target_angle = current_angle;
                            ghost_angle_q8 = current_angle << 8;
                            
                            if (rx_id != 0xFE) {
                                send_status_reply(0x04);
                            }
                        }
                        // 5. READ_CONFIG Command
                        else if (rx_instruction == 0x05) {
                            if (rx_id != 0xFE) {
                                send_config_reply();
                            }
                        }

