justimepassnow/custom_servo/mm32_test/src/main.c
                    }
                    rx_state = RX_STATE_HEADER1;
                }
                break;
        }
    }
}

// PID Controller Loop
void pid_update(uint32_t arr_period) {
    if (overcurrent_fault || stall_fault) {
        TIM_SetCompare3(TIM1, 0);
        TIM_SetCompare2(TIM1, 0);
        return;
    }

    if (!motor_armed) {
        TIM_SetCompare3(TIM1, 0);
        TIM_SetCompare2(TIM1, 0);
        return;
    }

    // 3. Compute error relative to the Ghost Target
    pid_error = ghost_angle_q8 - current_angle_q8;

    // 4. Check Deadband (only when Ghost Target has fully caught up to final target)
    if (ghost_angle_q8 == (target_angle << 8)) {
        int32_t abs_error = (pid_error >= 0) ? pid_error : -pid_error;
        if (abs_error < DEADBAND_Q8) {
            // Idle state: hold both inputs HIGH (100% duty) for active braking/slow decay
            TIM_SetCompare3(TIM1, arr_period);
            TIM_SetCompare2(TIM1, arr_period);
            pid_integral = 0;
            prev_error = 0;
            if (status_reporting_enabled) {
                status_reporting_enabled = 0;
#if DEBUG_LOG
                print_status();
                uart_print("[STATUS] Target reached! Motor is now idle.\r\n");
#endif
            }
            return;
        } else {
            // Actively tracking outside the deadband, so we are still moving
            status_reporting_enabled = 1;
        }
    }

    // 5. Calculate P, I, D outputs using Q24 scaling
    int64_t p_term = (int64_t)Kp_q16 * (int64_t)pid_error;

    pid_integral += pid_error;
    if (pid_integral > INTEGRAL_LIMIT_Q8) pid_integral = INTEGRAL_LIMIT_Q8;
    else if (pid_integral < -INTEGRAL_LIMIT_Q8) pid_integral = -INTEGRAL_LIMIT_Q8;
    
    int64_t i_term = ((int64_t)Ki_q16 * (int64_t)pid_integral) / 1000;

    pid_derivative = pid_error - prev_error;
    prev_error = pid_error;
    
    int64_t d_term = (int64_t)Kd_q16 * (int64_t)pid_derivative * 1000;

    int64_t pid_out_q24 = p_term + i_term + d_term;
    int32_t pid_out = (int32_t)(pid_out_q24 >> 24);

    // 6. Direct PWM generation
    int32_t pulse = (pid_out >= 0) ? pid_out : -pid_out;
    if (pulse > (int32_t)arr_period) {
        pulse = (int32_t)arr_period;
    }

    int8_t drive_direction = (pid_out >= 0) ? 1 : -1;
    if (config.direction_invert) {
        drive_direction = -drive_direction; // Swap effective direction
    }

    if (drive_direction > 0) {
        // Forward Direction (IN1 [CH3] = 100% High, IN2 [CH2] = Inverted PWM)
        TIM_SetCompare3(TIM1, arr_period);
        TIM_SetCompare2(TIM1, arr_period - pulse);
    } else {
        // Backward Direction (IN1 [CH3] = Inverted PWM, IN2 [CH2] = 100% High)
        TIM_SetCompare3(TIM1, arr_period - pulse);
        TIM_SetCompare2(TIM1, arr_period);
    }
}



// 1ms Critical Task Loop (Trajectory Ramping, Protection Checks & State Machine)
void one_ms_task(uint32_t arr_period) {
    // 1. Read potentiometer raw ADC and apply low pass filter (updates current_angle_q8 and current_angle)
    static int32_t filtered_adc_q8 = -1;
    uint16_t raw_adc = adc_read(ADC_Channel_7);
    int32_t raw_adc_q8 = ((int32_t)raw_adc) << 8;
    if (filtered_adc_q8 < 0) {
        filtered_adc_q8 = raw_adc_q8;
    } else {
        // alpha = 0.10 -> Q8 equivalent is 26/256 for smooth PID control
        filtered_adc_q8 = (26 * raw_adc_q8 + 230 * filtered_adc_q8) >> 8;
    }

    int32_t sweep = config.hard_max_angle - config.hard_min_angle;
    if (config.direction_invert) {
        current_angle_q8 = (config.hard_max_angle << 8) - (sweep * filtered_adc_q8) / 4095;
    } else {
        current_angle_q8 = (sweep * filtered_adc_q8) / 4095 + (config.hard_min_angle << 8);
    }
    current_angle = (current_angle_q8 + 128) >> 8;

    // 2. Over-Current Protection
    int32_t current_ma = read_current_ma();
    if (current_ma > (int32_t)config.current_limit) {
        overcurrent_ms++;
        if (overcurrent_ms >= 50) {
            overcurrent_fault = 1;
            TIM_SetCompare3(TIM1, 0);
            TIM_SetCompare2(TIM1, 0);
            return;
        }
    } else {
        overcurrent_ms = 0;
    }

    if (overcurrent_fault || stall_fault) {
        TIM_SetCompare3(TIM1, 0);
        TIM_SetCompare2(TIM1, 0);
        return;
    }

    // 3. Normal trajectory ramping and PID execution
    ghost_angle_q8 = target_angle << 8;
    pid_update(arr_period);
}

// Telemetry output logger
void print_status(void) {
    uart_print("[STATUS] Target: ");
    uart_print_int(target_angle);
    uart_print(" deg | Current: ");
    uart_print_int(current_angle);
    uart_print(" deg | Error: ");
    
    int32_t err = target_angle - current_angle;
    if (err < 0) {
        uart_print("-");
        uart_print_int(-err);
    } else {
        uart_print_int(err);
    }
    
    uart_print(" deg | Current Draw: ");
    uart_print_int(read_current_ma());
    uart_print(" mA | Duty: ");
    
    uint32_t pulse3 = TIM1->CCR3;
    uint32_t pulse2 = TIM1->CCR2;
    uint32_t arr = TIM1->ARR;
    if (arr == 0) arr = 1;
    
    if (pulse3 > 0) {
        uart_print_int((pulse3 * 100) / arr);
        uart_print("% (PA6 Forward)\r\n");
    } else if (pulse2 > 0) {
        uart_print_int((pulse2 * 100) / arr);
        uart_print("% (PA8 Backward)\r\n");
    } else {
        uart_print("0% (Idle/Deadband)\r\n");
    }
}

void calibrate_current_sensor(void) {
    int32_t sum = 0;
    // Take 16 quick sequential readings to calculate a clean average offset
    for (int i = 0; i < 16; i++) {
        sum += adc_read(ADC_Channel_5); // PA2 maps to ADC1_VIN[5]
        delay_ms(1);
    }
    zero_current_offset_adc = sum / 16;
    
#if DEBUG_LOG
    uart_print("Current Sensor Baseline Calibrated. Zero-Offset: ");
    uart_print_int(zero_current_offset_adc);
    uart_print(" raw ADC counts.\r\n");
#endif
}

int main(void) {
    GPIO_InitTypeDef        GPIO_InitStruct;
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStruct;
    TIM_OCInitTypeDef       TIM_OCInitStruct;

    // 1. Enable 1ms SysTick timekeeping interrupt
    SysTick_Config(48000000U / 1000);

    // 2. Initialize Single-Wire Half-Duplex USART1 at 115200 Baud
    uart_init();
#if DEBUG_LOG
    uart_print("\n--- Smart Servo Overhauled Firmware Init ---\n");
#endif

